Tekla.Structures.Drawing.DrawingHandler.GetConnectionStatus
Returns true if a proper connection to the Tekla Structures process has been established. A proper connection
to Tekla Stuctures in the drawing API needs Tekla Structures up and running and a model open. If, for some
reason, the connection has been lost, the method will return false. Currently, there's no way to
re-establish the connection.
Returns: True on success.

Tekla.Structures.Drawing.DrawingHandler.SetActiveDrawing(Tekla.Structures.Drawing.Drawing,System.Boolean)
Sets the active drawing that is currently open in Tekla Structures.
drawing: The drawing to be set as the active drawing.
showDrawing: Whether to open the drawing as visible or in the background (faster).
Returns: True on success.

Tekla.Structures.Drawing.DrawingHandler.UpdateDrawing(Tekla.Structures.Drawing.Drawing)
Updates the drawing.
This is the same as pressing Update on the drawing list for a selected drawing.
NOTE! The drawing cannot be active, otherwise the operation fails.
NOTE! Numbering must be executed before this operation.
Returns: True on success.